Tekla Open API Reference for Tekla Structures 2025
AnalysisVolume Methods
The AnalysisVolume type exposes the following members.
Methods
Name | Description
Select
 Selects an analysis volume. The ID has to be set.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
AnalysisVolume Class
Tekla.Structures.Analysis Namespace